#include<iostream>
using namespace std;
//二维数组
int main() {
	//二维数组的四种定义方式
	//1.数据类型 数组名[行数][列数]
	//2.数据类型 数组名[行数]]列数]={{数据1，数据2},{数据3，数据4}};
	//3.数据类型 数组名[行数]]列数]={数据1，数据2数据3，数据4};
	//4.数据类型 数组名[]]列数]={数据1，数据2数据3，数据4};
	/*int arr[2][3];
	arr[0][0] = 1;
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;
	for (int i = 0;i <= 1;i++) {
		for (int j = 0;j <= 2;j++) {
			cout << arr[i][j] << endl;
		}
	}*/
	
	//二维数组名称用途
	//1.可以查看占用内存空间大小
	/*int arr[2][3] = {
		{1,2,3},
		{4,5,6}
	};
	cout << "二维数组占用内存空间为：" << sizeof(arr) << endl;
	cout << "二维数组第一行占用内存空间为：" << sizeof(arr[0]) << endl;
	cout << "二维数组第一个元素占用内存空间为：" << sizeof(arr[0][0]) << endl;
	cout << "二维数组的行数为：" << sizeof(arr) / sizeof(arr[0]) << endl;
	cout << "二维数组的首地址为：" << (int)arr << endl;
	cout << "二维数组第一个元素的首地址" << (int)&arr[0][0] << endl;*/


	//二维数组应用案例
	//考试成绩统计
	//案例描述：有三名同学考了三门科目，分别输出三位同学的总成绩
	//1,创建二维数组，3行3列
	//2.统计总成绩，让每行的3列相加，统计出总成绩
	int scores[3][3] = {
		{100,100,100},
		{90,50,100},
		{60,70,80}
	};
	for (int i = 0;i <3;i++) {
		int sum = 0;
		for (int j = 0;j < 3;j++) {
			sum += scores[i][j];
			cout << scores[i][j] << " ";
		}
		cout <<"第 "<<i+1<<"个人的总分为："<< sum<<endl;
		}
	return 0;
}